### Assignment 3 - Store DB Checkpoint, due Weds Nov 16 by midnight

Once you have built the database and loaded the first month of sales, write some SQL queries to answer the following questions.

If you want to make sure your answers are correct, note that you could also check these things directly from the CSV file using pandas.  Just make sure that the answers you include here are the output of SQL queries run against your database!

In [31]:
import pandas as pd
import sqlite3

In [32]:
conn = sqlite3.connect('store.db')
curs = conn.cursor()

1) How many total customers are in the database?

In [33]:
pd.read_sql('''
SELECT count(*)
FROM tCust
;''',conn)

   count(*)
0       135

2. How many total orders in the database?

In [34]:
pd.read_sql('''
SELECT MAX(order_id) as total_Orders
FROM tOrderDetail
;''',conn)

   total_Orders
0           171

3. How many total order lines (i.e., records on tOrderDetail) in the database?

In [35]:
pd.read_sql('''
SELECT count(*) 
FROM tOrderDetail
;''',conn)

   count(*)
0       601

4. What are our total sales (sum of qty * unit price) so far?

In [37]:
pd.read_sql('''
SELECT sum(qty*unit_price) as sales
FROM tOrderDetail
JOIN tProd
USING(prod_id)
;''',conn)

       sales
0  124024.93

5. What is our top selling product (in terms of total quantity sold)?

In [38]:
pd.read_sql('''
SELECT prod_desc,Total_sold
FROM(
    SELECT max(Total_Sold) as top_selling_product, prod_id,Total_Sold
    FROM(
        SELECT sum(qty) as Total_Sold,prod_id
        FROM tOrderDetail
        GROUP BY prod_id
        )
    )
JOIN tProd
USING(Prod_id)
;''',conn)

  prod_desc  Total_Sold
0      Bolt         155

In [39]:
conn.close()